In [38]:
import pandas as pd
import numpy as np

In [39]:
data_dict = {
    'Col1':[1,2,3,np.nan],
    'Col2':[4, np.nan,6,7],
    'Col3':['a','b','c', None]
}

In [40]:
df = pd.DataFrame(data_dict)
df

   Col1  Col2  Col3
0   1.0   4.0     a
1   2.0   NaN     b
2   3.0   6.0     c
3   NaN   7.0  None

In [41]:
## Identify null values in a data frame

In [42]:
df.isnull()

    Col1   Col2   Col3
0  False  False  False
1  False   True  False
2  False  False  False
3   True  False   True

In [43]:
## Identify null values with a numeric value

In [44]:
df.isnull()*1

   Col1  Col2  Col3
0     0     0     0
1     0     1     0
2     0     0     0
3     1     0     1

In [45]:
## Replace null values with a string

In [46]:
df.fillna("Missing")

      Col1     Col2     Col3
0      1.0      4.0        a
1      2.0  Missing        b
2      3.0      6.0        c
3  Missing      7.0  Missing

In [49]:
##Â Interpolate the data

In [47]:
df.interpolate()

   Col1  Col2  Col3
0   1.0   4.0     a
1   2.0   5.0     b
2   3.0   6.0     c
3   3.0   7.0  None

In [48]:
## Replace null values with a statistical measure made with column values

In [33]:
numeric_cols = df.select_dtypes(include=np.number)
mean_values = numeric_cols.mean()

In [35]:
df[numeric_cols.columns] = numeric_cols.fillna(mean_values)
df

   Col1      Col2  Col3
0   1.0  4.000000     a
1   2.0  5.666667     b
2   3.0  6.000000     c
3   2.0  7.000000  None